export interface Question {
  id: number;
  question: string;
  answer: string;
}

export const quizQuestions: Question[] = [
  {
    id: 1,
    question: "В каком году Ормон хан был избран ханом?",
    answer: "1842"
  },
  {
    id: 2,
    question: "Как назывался свод законов Ормон хана?",
    answer: "Ормон окуу"
  },
  {
    id: 3,
    question: "Из какого племени происходил Ормон хан?",
    answer: "Сарыбагыш"
  },
  {
    id: 4,
    question: "В какой местности состоялся курултай?",
    answer: "Котмалды"
  },
  {
    id: 5,
    question: "Как назывался ритуал провозглашения ханом?",
    answer: "Ак кийизге салуу"
  },
  {
    id: 6,
    question: "Кого разбили кыргызы в Май-Тобинском сражении 1847 года?",
    answer: "Кенесары Касымов"
  },
  {
    id: 7,
    question: "В каком году Ормон хан отправил первое посольство в Россию?",
    answer: "1847"
  },
  {
    id: 8,
    question: "Как звали деда Ормон хана?",
    answer: "Эсенгул-бий"
  },
  {
    id: 9,
    question: "Какое племя взбунтовалось против власти Ормон хана?",
    answer: "Бугу"
  },
  {
    id: 10,
    question: "В каком году погиб Ормон хан?",
    answer: "1854"
  },
  {
    id: 11,
    question: "Влияние какого ханства Ормон ограничил на севере?",
    answer: "Кокандское ханство"
  },
  {
    id: 12,
    question: "Как называлась идея единства Ормон хана?",
    answer: "Ынтымак"
  }
];
